#+TITLE: Advent of Code 2024
#+SUBTITLE: Day 12: Garden Groups
#+AUTHOR: Michael R. Mauger
#+DATE: [Mon Dec 16 19:48:02 EST 2024]
#+STARTUP: showeverything inlineimages
#+OPTIONS: toc:nil
#+OPTIONS: ^:{}
#+OPTIONS: num:nil

#+AUTO_TANGLE: t
#+PROPERTY: header-args    :tangle no
#+PROPERTY: header-args    :noweb no-export

* Execution

#+BEGIN_SRC bash :results output
  LOAD_FILE=example.dat sqlite3 < garden-groups.sql
  LOAD_FILE=input.dat   sqlite3 < garden-groups.sql
#+END_SRC

#+RESULTS:
#+begin_example
Run Time: real 0.005 user 0.000000 sys 0.001031
changes: 0   total_changes: 0
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 100       │
└───────────┘
Run Time: real 0.000 user 0.000017 sys 0.000051
changes: 1   total_changes: 100
Run Time: real 0.004 user 0.000000 sys 0.001061
changes: 1   total_changes: 100
Run Time: real 0.005 user 0.000045 sys 0.001210
changes: 1   total_changes: 100
Run Time: real 0.005 user 0.001226 sys 0.000316
changes: 1   total_changes: 100
┌───────────┬─────────────────┐
│ vegetable │ vegetable_price │
├───────────┼─────────────────┤
│ 'C'       │ 392             │
│ 'C'       │ 4               │
│ 'E'       │ 234             │
│ 'F'       │ 180             │
│ 'I'       │ 32              │
│ 'I'       │ 308             │
│ 'J'       │ 220             │
│ 'M'       │ 60              │
│ 'R'       │ 216             │
│ 'S'       │ 24              │
│ 'V'       │ 260             │
└───────────┴─────────────────┘
Run Time: real 0.010 user 0.007897 sys 0.002315
changes: 1   total_changes: 100
┌─────────────────────────┐
│ Part One: Garden Groups │
├─────────────────────────┤
│ 1930                    │
└─────────────────────────┘
Run Time: real 0.006 user 0.003189 sys 0.002132
changes: 1   total_changes: 100
Memory Used:                         183592 (max 1847880) bytes
Number of Outstanding Allocations:   501 (max 1651)
Number of Pcache Overflow Bytes:     8208 (max 131328) bytes
Largest Allocation:                  87360 bytes
Largest Pcache Allocation:           4104 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       6307
Lookaside failures due to size:      27
Lookaside failures due to OOM:       4748
Pager Heap Usage:                    22488 bytes
Page cache hits:                     1143
Page cache misses:                   0
Page cache writes:                   11
Page cache spills:                   0
Schema Heap Usage:                   26192 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            25551
Bytes sent to write():               79276
Read() system calls:                 55
Write() system calls:                50
Bytes read from storage:             0
Bytes written to storage:            622592
Cancelled write bytes:               0
Run Time: real 0.004 user 0.000000 sys 0.000947
changes: 0   total_changes: 0
┌───────────┐
│ COUNT (*) │
├───────────┤
│ 19600     │
└───────────┘
Run Time: real 0.000 user 0.000056 sys 0.000007
changes: 1   total_changes: 19600
Run Time: real 0.004 user 0.000000 sys 0.000857
changes: 1   total_changes: 19600
Run Time: real 0.004 user 0.000557 sys 0.000238
changes: 1   total_changes: 19600
Run Time: real 0.006 user 0.000000 sys 0.000795
changes: 1   total_changes: 19600
┌───────────┬─────────────────┐
│ vegetable │ vegetable_price │
├───────────┼─────────────────┤
│ 'A'       │ 2940            │
│ 'A'       │ 4               │
│ 'A'       │ 1764            │
│ 'A'       │ 12              │
│ 'A'       │ 12              │
│ 'A'       │ 4278            │
│ 'A'       │ 24              │
│ 'A'       │ 4               │
│ 'A'       │ 2320            │
│ 'A'       │ 12684           │
│ 'A'       │ 24              │
│ 'A'       │ 10640           │
│ 'A'       │ 5760            │
│ 'A'       │ 8364            │
│ 'A'       │ 4               │
│ 'A'       │ 4               │
│ 'A'       │ 144             │
│ 'A'       │ 4               │
│ 'A'       │ 468             │
│ 'B'       │ 112             │
│ 'B'       │ 60              │
│ 'B'       │ 24              │
│ 'B'       │ 1386            │
│ 'B'       │ 4               │
│ 'B'       │ 4140            │
│ 'B'       │ 4               │
│ 'B'       │ 3040            │
│ 'B'       │ 220             │
│ 'B'       │ 12190           │
│ 'B'       │ 4               │
│ 'B'       │ 4               │
│ 'B'       │ 8816            │
│ 'B'       │ 420             │
│ 'B'       │ 800             │
│ 'B'       │ 4               │
│ 'B'       │ 4               │
│ 'B'       │ 12              │
│ 'B'       │ 4               │
│ 'B'       │ 84              │
│ 'B'       │ 4984            │
│ 'B'       │ 4               │
│ 'B'       │ 4               │
│ 'C'       │ 4               │
│ 'C'       │ 72              │
│ 'C'       │ 6438            │
│ 'C'       │ 420             │
│ 'C'       │ 4               │
│ 'C'       │ 6440            │
│ 'C'       │ 4               │
│ 'C'       │ 4060            │
│ 'C'       │ 1840            │
│ 'C'       │ 4               │
│ 'C'       │ 24              │
│ 'C'       │ 4               │
│ 'C'       │ 4               │
│ 'C'       │ 4               │
│ 'C'       │ 4588            │
│ 'C'       │ 12              │
│ 'C'       │ 200             │
│ 'C'       │ 4               │
│ 'C'       │ 4               │
│ 'C'       │ 24              │
│ 'C'       │ 14796           │
│ 'C'       │ 4               │
│ 'C'       │ 4               │
│ 'C'       │ 4               │
│ 'C'       │ 4               │
│ 'D'       │ 5452            │
│ 'D'       │ 4               │
│ 'D'       │ 10952           │
│ 'D'       │ 4350            │
│ 'D'       │ 4               │
│ 'D'       │ 4               │
│ 'D'       │ 646             │
│ 'D'       │ 12              │
│ 'D'       │ 72              │
│ 'D'       │ 40              │
│ 'D'       │ 24              │
│ 'D'       │ 4               │
│ 'D'       │ 12              │
│ 'D'       │ 3920            │
│ 'D'       │ 12              │
│ 'D'       │ 50              │
│ 'D'       │ 2538            │
│ 'D'       │ 9280            │
│ 'D'       │ 4               │
│ 'D'       │ 1122            │
│ 'D'       │ 4               │
│ 'D'       │ 2800            │
│ 'D'       │ 4               │
│ 'D'       │ 112             │
│ 'D'       │ 4               │
│ 'E'       │ 192             │
│ 'E'       │ 4176            │
│ 'E'       │ 4               │
│ 'E'       │ 1102            │
│ 'E'       │ 32              │
│ 'E'       │ 32              │
│ 'E'       │ 1610            │
│ 'E'       │ 12              │
│ 'E'       │ 4               │
│ 'E'       │ 4               │
│ 'E'       │ 12792           │
│ 'E'       │ 264             │
│ 'E'       │ 4               │
│ 'E'       │ 72              │
│ 'E'       │ 4               │
│ 'E'       │ 780             │
│ 'E'       │ 216             │
│ 'E'       │ 2646            │
│ 'E'       │ 4               │
│ 'E'       │ 3904            │
│ 'E'       │ 3276            │
│ 'E'       │ 144             │
│ 'E'       │ 704             │
│ 'F'       │ 5280            │
│ 'F'       │ 144             │
│ 'F'       │ 3364            │
│ 'F'       │ 1330            │
│ 'F'       │ 12              │
│ 'F'       │ 60              │
│ 'F'       │ 5478            │
│ 'F'       │ 128             │
│ 'F'       │ 9694            │
│ 'F'       │ 5510            │
│ 'F'       │ 24              │
│ 'F'       │ 4               │
│ 'F'       │ 24              │
│ 'F'       │ 4               │
│ 'F'       │ 4               │
│ 'F'       │ 4               │
│ 'F'       │ 396             │
│ 'F'       │ 40              │
│ 'F'       │ 12              │
│ 'F'       │ 3782            │
│ 'F'       │ 12              │
│ 'F'       │ 4               │
│ 'F'       │ 20628           │
│ 'F'       │ 4               │
│ 'F'       │ 4               │
│ 'F'       │ 420             │
│ 'F'       │ 112             │
│ 'F'       │ 40              │
│ 'G'       │ 60              │
│ 'G'       │ 3078            │
│ 'G'       │ 4930            │
│ 'G'       │ 7254            │
│ 'G'       │ 12              │
│ 'G'       │ 240             │
│ 'G'       │ 72              │
│ 'G'       │ 32              │
│ 'G'       │ 24              │
│ 'G'       │ 60              │
│ 'G'       │ 6592            │
│ 'G'       │ 6320            │
│ 'G'       │ 4               │
│ 'G'       │ 12              │
│ 'G'       │ 2080            │
│ 'G'       │ 9196            │
│ 'G'       │ 24              │
│ 'G'       │ 200             │
│ 'G'       │ 12              │
│ 'G'       │ 98              │
│ 'G'       │ 4               │
│ 'G'       │ 32              │
│ 'G'       │ 4420            │
│ 'G'       │ 4               │
│ 'G'       │ 7630            │
│ 'G'       │ 24              │
│ 'G'       │ 7350            │
│ 'G'       │ 4               │
│ 'G'       │ 2016            │
│ 'G'       │ 4               │
│ 'G'       │ 4               │
│ 'G'       │ 4               │
│ 'G'       │ 40              │
│ 'G'       │ 5208            │
│ 'G'       │ 3174            │
│ 'G'       │ 2576            │
│ 'G'       │ 12              │
│ 'H'       │ 4               │
│ 'H'       │ 4               │
│ 'H'       │ 4               │
│ 'H'       │ 4               │
│ 'H'       │ 4               │
│ 'H'       │ 12              │
│ 'H'       │ 972             │
│ 'H'       │ 4               │
│ 'H'       │ 12288           │
│ 'H'       │ 2448            │
│ 'H'       │ 4               │
│ 'H'       │ 3808            │
│ 'H'       │ 126             │
│ 'H'       │ 40              │
│ 'H'       │ 72              │
│ 'H'       │ 4               │
│ 'H'       │ 286             │
│ 'H'       │ 154             │
│ 'H'       │ 4               │
│ 'H'       │ 24              │
│ 'H'       │ 4               │
│ 'H'       │ 1184            │
│ 'H'       │ 5160            │
│ 'H'       │ 84              │
│ 'H'       │ 4               │
│ 'H'       │ 4               │
│ 'H'       │ 84              │
│ 'H'       │ 4               │
│ 'H'       │ 6510            │
│ 'I'       │ 198             │
│ 'I'       │ 252             │
│ 'I'       │ 5312            │
│ 'I'       │ 4               │
│ 'I'       │ 4               │
│ 'I'       │ 4               │
│ 'I'       │ 128             │
│ 'I'       │ 4698            │
│ 'I'       │ 352             │
│ 'I'       │ 24              │
│ 'I'       │ 4               │
│ 'I'       │ 4               │
│ 'I'       │ 4               │
│ 'I'       │ 4               │
│ 'I'       │ 6400            │
│ 'I'       │ 4               │
│ 'I'       │ 6666            │
│ 'I'       │ 9120            │
│ 'I'       │ 4               │
│ 'I'       │ 7776            │
│ 'I'       │ 4               │
│ 'I'       │ 72              │
│ 'J'       │ 12              │
│ 'J'       │ 4536            │
│ 'J'       │ 4               │
│ 'J'       │ 12              │
│ 'J'       │ 4               │
│ 'J'       │ 9360            │
│ 'J'       │ 4               │
│ 'J'       │ 24816           │
│ 'J'       │ 4860            │
│ 'J'       │ 4               │
│ 'J'       │ 4               │
│ 'J'       │ 1548            │
│ 'J'       │ 11610           │
│ 'J'       │ 12              │
│ 'J'       │ 4               │
│ 'J'       │ 24              │
│ 'J'       │ 4               │
│ 'J'       │ 24              │
│ 'J'       │ 280             │
│ 'J'       │ 630             │
│ 'J'       │ 12              │
│ 'J'       │ 4               │
│ 'J'       │ 50              │
│ 'J'       │ 4               │
│ 'J'       │ 12              │
│ 'J'       │ 4               │
│ 'J'       │ 4               │
│ 'J'       │ 4               │
│ 'K'       │ 9728            │
│ 'K'       │ 126             │
│ 'K'       │ 84              │
│ 'K'       │ 2580            │
│ 'K'       │ 9440            │
│ 'K'       │ 9240            │
│ 'K'       │ 84              │
│ 'K'       │ 4002            │
│ 'K'       │ 4               │
│ 'K'       │ 32              │
│ 'K'       │ 33880           │
│ 'K'       │ 4               │
│ 'K'       │ 4               │
│ 'K'       │ 12              │
│ 'K'       │ 4               │
│ 'K'       │ 1512            │
│ 'K'       │ 924             │
│ 'K'       │ 11232           │
│ 'K'       │ 10246           │
│ 'K'       │ 418             │
│ 'L'       │ 4               │
│ 'L'       │ 728             │
│ 'L'       │ 4               │
│ 'L'       │ 84              │
│ 'L'       │ 4               │
│ 'L'       │ 4               │
│ 'L'       │ 1404            │
│ 'L'       │ 4               │
│ 'L'       │ 24              │
│ 'L'       │ 9912            │
│ 'L'       │ 4               │
│ 'L'       │ 60              │
│ 'L'       │ 4               │
│ 'L'       │ 24              │
│ 'L'       │ 162             │
│ 'L'       │ 1560            │
│ 'L'       │ 12              │
│ 'L'       │ 4               │
│ 'L'       │ 4               │
│ 'M'       │ 7552            │
│ 'M'       │ 9676            │
│ 'M'       │ 12              │
│ 'M'       │ 3216            │
│ 'M'       │ 4               │
│ 'M'       │ 160             │
│ 'M'       │ 20352           │
│ 'M'       │ 4               │
│ 'M'       │ 4               │
│ 'M'       │ 4               │
│ 'M'       │ 4               │
│ 'M'       │ 504             │
│ 'M'       │ 4               │
│ 'M'       │ 4               │
│ 'M'       │ 4920            │
│ 'M'       │ 3990            │
│ 'M'       │ 12              │
│ 'M'       │ 21360           │
│ 'M'       │ 144             │
│ 'N'       │ 6324            │
│ 'N'       │ 736             │
│ 'N'       │ 6016            │
│ 'N'       │ 1360            │
│ 'N'       │ 4               │
│ 'N'       │ 144             │
│ 'N'       │ 12556           │
│ 'N'       │ 4               │
│ 'N'       │ 14100           │
│ 'N'       │ 8080            │
│ 'N'       │ 7844            │
│ 'N'       │ 756             │
│ 'N'       │ 1404            │
│ 'N'       │ 4               │
│ 'N'       │ 12826           │
│ 'N'       │ 12              │
│ 'N'       │ 4               │
│ 'N'       │ 1720            │
│ 'N'       │ 3828            │
│ 'N'       │ 10836           │
│ 'N'       │ 4               │
│ 'N'       │ 4               │
│ 'N'       │ 98              │
│ 'N'       │ 1444            │
│ 'N'       │ 4               │
│ 'N'       │ 3900            │
│ 'N'       │ 84              │
│ 'N'       │ 264             │
│ 'N'       │ 10260           │
│ 'N'       │ 7656            │
│ 'N'       │ 4               │
│ 'N'       │ 4               │
│ 'O'       │ 4466            │
│ 'O'       │ 144             │
│ 'O'       │ 6420            │
│ 'O'       │ 4               │
│ 'O'       │ 4092            │
│ 'O'       │ 12              │
│ 'O'       │ 4               │
│ 'O'       │ 6720            │
│ 'O'       │ 4               │
│ 'O'       │ 8814            │
│ 'O'       │ 4               │
│ 'O'       │ 12              │
│ 'O'       │ 6300            │
│ 'O'       │ 60              │
│ 'O'       │ 12              │
│ 'O'       │ 50              │
│ 'O'       │ 4582            │
│ 'O'       │ 12584           │
│ 'O'       │ 4368            │
│ 'O'       │ 4               │
│ 'O'       │ 98              │
│ 'O'       │ 644             │
│ 'O'       │ 364             │
│ 'P'       │ 7194            │
│ 'P'       │ 4               │
│ 'P'       │ 24              │
│ 'P'       │ 4               │
│ 'P'       │ 24              │
│ 'P'       │ 4               │
│ 'P'       │ 24              │
│ 'P'       │ 4               │
│ 'P'       │ 1120            │
│ 'P'       │ 3300            │
│ 'P'       │ 2850            │
│ 'P'       │ 2080            │
│ 'P'       │ 3536            │
│ 'P'       │ 5952            │
│ 'P'       │ 264             │
│ 'P'       │ 7854            │
│ 'P'       │ 24              │
│ 'P'       │ 12              │
│ 'P'       │ 520             │
│ 'P'       │ 4               │
│ 'P'       │ 13344           │
│ 'P'       │ 4               │
│ 'P'       │ 7208            │
│ 'P'       │ 4               │
│ 'P'       │ 4               │
│ 'P'       │ 2912            │
│ 'Q'       │ 7072            │
│ 'Q'       │ 4               │
│ 'Q'       │ 4               │
│ 'Q'       │ 4               │
│ 'Q'       │ 84              │
│ 'Q'       │ 1080            │
│ 'Q'       │ 12              │
│ 'Q'       │ 972             │
│ 'Q'       │ 4               │
│ 'Q'       │ 4               │
│ 'Q'       │ 1760            │
│ 'Q'       │ 6262            │
│ 'Q'       │ 72              │
│ 'Q'       │ 72              │
│ 'Q'       │ 24              │
│ 'Q'       │ 12              │
│ 'Q'       │ 3016            │
│ 'Q'       │ 4               │
│ 'Q'       │ 4               │
│ 'Q'       │ 4               │
│ 'Q'       │ 4               │
│ 'Q'       │ 1540            │
│ 'Q'       │ 4               │
│ 'Q'       │ 1936            │
│ 'Q'       │ 11476           │
│ 'Q'       │ 1520            │
│ 'Q'       │ 4               │
│ 'Q'       │ 10580           │
│ 'Q'       │ 24              │
│ 'R'       │ 12546           │
│ 'R'       │ 1596            │
│ 'R'       │ 4               │
│ 'R'       │ 180             │
│ 'R'       │ 5168            │
│ 'R'       │ 11690           │
│ 'R'       │ 4               │
│ 'R'       │ 4356            │
│ 'R'       │ 4               │
│ 'R'       │ 4               │
│ 'R'       │ 4               │
│ 'R'       │ 6000            │
│ 'R'       │ 4               │
│ 'R'       │ 4               │
│ 'R'       │ 4               │
│ 'R'       │ 4740            │
│ 'R'       │ 570             │
│ 'R'       │ 4               │
│ 'R'       │ 1786            │
│ 'R'       │ 840             │
│ 'R'       │ 160             │
│ 'R'       │ 4               │
│ 'R'       │ 4               │
│ 'S'       │ 12              │
│ 'S'       │ 40              │
│ 'S'       │ 7140            │
│ 'S'       │ 4               │
│ 'S'       │ 24              │
│ 'S'       │ 448             │
│ 'S'       │ 4               │
│ 'S'       │ 12              │
│ 'S'       │ 4180            │
│ 'S'       │ 1280            │
│ 'S'       │ 1496            │
│ 'S'       │ 4               │
│ 'S'       │ 7680            │
│ 'S'       │ 24              │
│ 'T'       │ 476             │
│ 'T'       │ 4               │
│ 'T'       │ 4               │
│ 'T'       │ 4               │
│ 'T'       │ 4320            │
│ 'T'       │ 4               │
│ 'T'       │ 4               │
│ 'T'       │ 4               │
│ 'T'       │ 2322            │
│ 'T'       │ 19552           │
│ 'T'       │ 1512            │
│ 'T'       │ 1248            │
│ 'T'       │ 128             │
│ 'T'       │ 50              │
│ 'T'       │ 4               │
│ 'T'       │ 18360           │
│ 'T'       │ 24              │
│ 'T'       │ 784             │
│ 'T'       │ 84              │
│ 'T'       │ 32              │
│ 'T'       │ 198             │
│ 'T'       │ 1548            │
│ 'T'       │ 456             │
│ 'T'       │ 952             │
│ 'T'       │ 15134           │
│ 'T'       │ 112             │
│ 'U'       │ 180             │
│ 'U'       │ 14018           │
│ 'U'       │ 8480            │
│ 'U'       │ 1548            │
│ 'U'       │ 40              │
│ 'U'       │ 8720            │
│ 'U'       │ 4               │
│ 'U'       │ 2024            │
│ 'U'       │ 4               │
│ 'U'       │ 162             │
│ 'U'       │ 4               │
│ 'U'       │ 4               │
│ 'U'       │ 4               │
│ 'U'       │ 4               │
│ 'U'       │ 144             │
│ 'U'       │ 4               │
│ 'U'       │ 4               │
│ 'U'       │ 4               │
│ 'U'       │ 11092           │
│ 'U'       │ 126             │
│ 'U'       │ 260             │
│ 'U'       │ 3304            │
│ 'U'       │ 4               │
│ 'U'       │ 4               │
│ 'U'       │ 4002            │
│ 'U'       │ 4               │
│ 'U'       │ 22360           │
│ 'U'       │ 4320            │
│ 'U'       │ 330             │
│ 'U'       │ 840             │
│ 'V'       │ 4               │
│ 'V'       │ 180             │
│ 'V'       │ 4               │
│ 'V'       │ 18792           │
│ 'V'       │ 2622            │
│ 'V'       │ 24              │
│ 'V'       │ 3504            │
│ 'V'       │ 4               │
│ 'V'       │ 7700            │
│ 'V'       │ 12              │
│ 'V'       │ 624             │
│ 'V'       │ 10758           │
│ 'V'       │ 4               │
│ 'V'       │ 4               │
│ 'V'       │ 4               │
│ 'V'       │ 4               │
│ 'V'       │ 12              │
│ 'V'       │ 1600            │
│ 'V'       │ 4               │
│ 'W'       │ 8732            │
│ 'W'       │ 280             │
│ 'W'       │ 5376            │
│ 'W'       │ 144             │
│ 'W'       │ 12              │
│ 'W'       │ 24              │
│ 'W'       │ 24              │
│ 'W'       │ 4               │
│ 'W'       │ 4               │
│ 'W'       │ 4               │
│ 'W'       │ 4               │
│ 'W'       │ 12              │
│ 'W'       │ 560             │
│ 'W'       │ 4               │
│ 'W'       │ 60              │
│ 'W'       │ 4               │
│ 'W'       │ 24              │
│ 'W'       │ 1218            │
│ 'W'       │ 12              │
│ 'W'       │ 4               │
│ 'W'       │ 896             │
│ 'W'       │ 1406            │
│ 'W'       │ 11954           │
│ 'W'       │ 4               │
│ 'W'       │ 40              │
│ 'W'       │ 4               │
│ 'W'       │ 420             │
│ 'W'       │ 60              │
│ 'W'       │ 4               │
│ 'W'       │ 24              │
│ 'W'       │ 72              │
│ 'W'       │ 4               │
│ 'W'       │ 432             │
│ 'W'       │ 4               │
│ 'X'       │ 600             │
│ 'X'       │ 4               │
│ 'X'       │ 24              │
│ 'X'       │ 12              │
│ 'X'       │ 4               │
│ 'X'       │ 4               │
│ 'X'       │ 4788            │
│ 'X'       │ 24              │
│ 'X'       │ 468             │
│ 'X'       │ 6660            │
│ 'X'       │ 756             │
│ 'X'       │ 4               │
│ 'X'       │ 40              │
│ 'X'       │ 4               │
│ 'X'       │ 4               │
│ 'X'       │ 4               │
│ 'X'       │ 3800            │
│ 'X'       │ 4               │
│ 'X'       │ 12              │
│ 'X'       │ 12              │
│ 'Y'       │ 84              │
│ 'Y'       │ 782             │
│ 'Y'       │ 4               │
│ 'Y'       │ 9760            │
│ 'Y'       │ 4               │
│ 'Y'       │ 10032           │
│ 'Y'       │ 144             │
│ 'Y'       │ 5280            │
│ 'Y'       │ 4               │
│ 'Y'       │ 12152           │
│ 'Y'       │ 84              │
│ 'Y'       │ 24              │
│ 'Y'       │ 12848           │
│ 'Y'       │ 714             │
│ 'Y'       │ 12              │
│ 'Z'       │ 720             │
│ 'Z'       │ 4               │
│ 'Z'       │ 8228            │
│ 'Z'       │ 6068            │
│ 'Z'       │ 60              │
│ 'Z'       │ 4               │
│ 'Z'       │ 4               │
│ 'Z'       │ 4               │
│ 'Z'       │ 4               │
│ 'Z'       │ 4               │
│ 'Z'       │ 12              │
│ 'Z'       │ 4               │
│ 'Z'       │ 2160            │
│ 'Z'       │ 4               │
│ 'Z'       │ 12040           │
│ 'Z'       │ 24              │
│ 'Z'       │ 2756            │
│ 'Z'       │ 2360            │
│ 'Z'       │ 12              │
│ 'Z'       │ 12              │
│ 'Z'       │ 180             │
└───────────┴─────────────────┘
Run Time: real 1.896 user 1.874072 sys 0.011698
changes: 1   total_changes: 19600
┌─────────────────────────┐
│ Part One: Garden Groups │
├─────────────────────────┤
│ 1319878                 │
└─────────────────────────┘
Run Time: real 1.891 user 1.875946 sys 0.006965
changes: 1   total_changes: 19600
Memory Used:                         944920 (max 13165648) bytes
Number of Outstanding Allocations:   675 (max 2217)
Number of Pcache Overflow Bytes:     769632 (max 5741088) bytes
Largest Allocation:                  2048000 bytes
Largest Pcache Allocation:           4368 bytes
Lookaside Slots Used:                46 (max 123)
Successful lookaside attempts:       2395637
Lookaside failures due to size:      27
Lookaside failures due to OOM:       735258
Pager Heap Usage:                    849368 bytes
Page cache hits:                     4286063
Page cache misses:                   0
Page cache writes:                   201
Page cache spills:                   0
Schema Heap Usage:                   26096 bytes
Statement Heap/Lookaside Usage:      0 bytes
Bytes received by read():            5065233
Bytes sent to write():               7031560
Read() system calls:                 1291
Write() system calls:                1753
Bytes read from storage:             0
Bytes written to storage:            7331840
Cancelled write bytes:               5767168
#+end_example
